notsotalented/mProcessor-Lab3/STM32/1852238-Lab3/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_RED_Pin GPIO_PIN_1
#define LED_RED_GPIO_Port GPIOA
#define RED_0_Pin GPIO_PIN_2
#define RED_0_GPIO_Port GPIOA
#define YELLOW_0_Pin GPIO_PIN_3
#define YELLOW_0_GPIO_Port GPIOA
#define GREEN_0_Pin GPIO_PIN_4
#define GREEN_0_GPIO_Port GPIOA
#define RED_1_Pin GPIO_PIN_5
#define RED_1_GPIO_Port GPIOA
#define YELLOW_1_Pin GPIO_PIN_6
#define YELLOW_1_GPIO_Port GPIOA
#define GREEN_1_Pin GPIO_PIN_7
#define GREEN_1_GPIO_Port GPIOA
#define LED7_SEG0_Pin GPIO_PIN_0
#define LED7_SEG0_GPIO_Port GPIOB
#define LED7_SEG1_Pin GPIO_PIN_1
#define LED7_SEG1_GPIO_Port GPIOB
#define LED7_SEG2_Pin GPIO_PIN_2
#define LED7_SEG2_GPIO_Port GPIOB
#define LED7_SEG3S_Pin GPIO_PIN_10
#define LED7_SEG3S_GPIO_Port GPIOB
#define LED7_SEG4S_Pin GPIO_PIN_11
#define LED7_SEG4S_GPIO_Port GPIOB
#define LED7_SEG5S_Pin GPIO_PIN_12
#define LED7_SEG5S_GPIO_Port GPIOB
#define LED7_SEG6S_Pin GPIO_PIN_13
#define LED7_SEG6S_GPIO_Port GPIOB
#define EN0_Pin GPIO_PIN_8
#define EN0_GPIO_Port GPIOA
#define EN1_Pin GPIO_PIN_9
#define EN1_GPIO_Port GPIOA
#define BUTTON_1_Pin GPIO_PIN_13
#define BUTTON_1_GPIO_Port GPIOA
#define BUTTON_2_Pin GPIO_PIN_14
#define BUTTON_2_GPIO_Port GPIOA
#define BUTTON_3_Pin GPIO_PIN_15
#define BUTTON_3_GPIO_Port GPIOA
#define LED7_SEG3_Pin GPIO_PIN_3
#define LED7_SEG3_GPIO_Port GPIOB
#define LED7_SEG4_Pin GPIO_PIN_4
#define LED7_SEG4_GPIO_Port GPIOB
#define LED7_SEG5_Pin GPIO_PIN_5
#define LED7_SEG5_GPIO_Port GPIOB
#define LED7_SEG6_Pin GPIO_PIN_6
#define LED7_SEG6_GPIO_Port GPIOB
#define LED7_SEG0S_Pin GPIO_PIN_7
#define LED7_SEG0S_GPIO_Port GPIOB
#define LED7_SEG1S_Pin GPIO_PIN_8
#define LED7_SEG1S_GPIO_Port GPIOB
#define LED7_SEG2S_Pin GPIO_PIN_9
#define LED7_SEG2S_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
